eboxmaker/eBox_Framework/mcuLib/N32G030/n32g030_std_periph_driver/src/n32g030_lptim.c
/** @defgroup LPTIM_EF_Trigger_Configuration Trigger Configuration
  * @{
  */

/**
  * @brief  Enable the timeout function
  * @note This function must be called when the LPTIM instance is disabled.
  * @note The first trigger event will start the timer, any successive trigger
  *       event will reset the counter and the timer will restart.
  * @note The timeout value corresponds to the compare value; if no trigger
  *       occurs within the expected time frame, the MCU is waked-up by the
  *       compare match event.
  * @rmtoll CFG         TIMOUT        LPTIM_EnableTimeout
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_EnableTimeout(LPTIM_Module *LPTIMx)
{
    SET_BIT(LPTIMx->CFG, LPTIM_CFG_TIMOUTEN);
}

/**
  * @brief  Disable the timeout function
  * @note This function must be called when the LPTIM instance is disabled.
  * @note A trigger event arriving when the timer is already started will be
  *       ignored.
  * @rmtoll CFG         TIMOUT        LPTIM_DisableTimeout
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_DisableTimeout(LPTIM_Module *LPTIMx)
{
    CLEAR_BIT(LPTIMx->CFG, LPTIM_CFG_TIMOUTEN);
}

/**
  * @brief  Indicate whether the timeout function is enabled.
  * @rmtoll CFG         TIMOUT        LPTIM_IsEnabledTimeout
  * @param  LPTIMx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
uint32_t LPTIM_IsEnabledTimeout(LPTIM_Module *LPTIMx)
{
    return (((READ_BIT(LPTIMx->CFG, LPTIM_CFG_TIMOUTEN) == LPTIM_CFG_TIMOUTEN)? 1UL : 0UL));
}

/**
  * @brief  Start the LPTIM counter
  * @note This function must be called when the LPTIM instance is disabled.
  * @rmtoll CFG         TRIGEN        LPTIM_TrigSw
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_TrigSw(LPTIM_Module *LPTIMx)
{
    CLEAR_BIT(LPTIMx->CFG, LPTIM_CFG_TRGEN);
}

/**
  * @brief  Configure the external trigger used as a trigger event for the LPTIM.
  * @note This function must be called when the LPTIM instance is disabled.
  * @note An internal clock source must be present when a digital filter is
  *       required for the trigger.
  * @rmtoll CFG         TRIGSEL       LPTIM_ConfigTrigger\n
  *         CFG         TRGFLT        LPTIM_ConfigTrigger\n
  *         CFG         TRIGEN        LPTIM_ConfigTrigger
  * @param  LPTIMx Low-Power Timer instance
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref LPTIM_TRIG_SOURCE_GPIO
  *         @arg @ref LPTIM_TRIG_SOURCE_RTCALARMA
  *         @arg @ref LPTIM_TRIG_SOURCE_RTCALARMB
  *         @arg @ref LPTIM_TRIG_SOURCE_RTCTAMP1 (*)
  *         @arg @ref LPTIM_TRIG_SOURCE_RTCTAMP2
  *         @arg @ref LPTIM_TRIG_SOURCE_RTCTAMP3 (*)
  *         @arg @ref LPTIM_TRIG_SOURCE_COMP1
  *         @arg @ref LPTIM_TRIG_SOURCE_COMP2
  *
  *         (*)  Value not defined in all devices. \n
  *
  * @param  Filter This parameter can be one of the following values:
  *         @arg @ref LPTIM_TRIG_FILTER_NONE
  *         @arg @ref LPTIM_TRIG_FILTER_2
  *         @arg @ref LPTIM_TRIG_FILTER_4
  *         @arg @ref LPTIM_TRIG_FILTER_8
  * @param  Polarity This parameter can be one of the following values:
  *         @arg @ref LPTIM_TRIG_POLARITY_RISING
  *         @arg @ref LPTIM_TRIG_POLARITY_FALLING
  *         @arg @ref LPTIM_TRIG_POLARITY_RISING_FALLING
  * @retval None
  */
void LPTIM_ConfigTrigger(LPTIM_Module *LPTIMx, uint32_t Source, uint32_t Filter, uint32_t Polarity)
{
    MODIFY_REG(LPTIMx->CFG, LPTIM_CFG_TRGSEL | LPTIM_CFG_TRIGFLT | LPTIM_CFG_TRGEN, Source | Filter | Polarity);
}

/**
  * @brief  Get actual external trigger source.
  * @rmtoll CFG         TRIGSEL       LPTIM_GetTriggerSource
  * @param  LPTIMx Low-Power Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LPTIM_TRIG_SOURCE_GPIO
  *         @arg @ref LPTIM_TRIG_SOURCE_RTCALARMA
  *         @arg @ref LPTIM_TRIG_SOURCE_RTCALARMB
  *         @arg @ref LPTIM_TRIG_SOURCE_RTCTAMP1 (*)
  *         @arg @ref LPTIM_TRIG_SOURCE_RTCTAMP2
  *         @arg @ref LPTIM_TRIG_SOURCE_RTCTAMP3 (*)
  *         @arg @ref LPTIM_TRIG_SOURCE_COMP1
  *         @arg @ref LPTIM_TRIG_SOURCE_COMP2
  *
  *         (*)  Value not defined in all devices. \n
  *
  */
uint32_t LPTIM_GetTriggerSource(LPTIM_Module *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->CFG, LPTIM_CFG_TRGSEL));
}

/**
  * @brief  Get actual external trigger filter.
  * @rmtoll CFG         TRGFLT        LPTIM_GetTriggerFilter
  * @param  LPTIMx Low-Power Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LPTIM_TRIG_FILTER_NONE
  *         @arg @ref LPTIM_TRIG_FILTER_2
  *         @arg @ref LPTIM_TRIG_FILTER_4
  *         @arg @ref LPTIM_TRIG_FILTER_8
  */
uint32_t LPTIM_GetTriggerFilter(LPTIM_Module *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->CFG, LPTIM_CFG_TRIGFLT));
}

/**
  * @brief  Get actual external trigger polarity.
  * @rmtoll CFG         TRIGEN        LPTIM_GetTriggerPolarity
  * @param  LPTIMx Low-Power Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LPTIM_TRIG_POLARITY_RISING
  *         @arg @ref LPTIM_TRIG_POLARITY_FALLING
  *         @arg @ref LPTIM_TRIG_POLARITY_RISING_FALLING
  */
uint32_t LPTIM_GetTriggerPolarity(LPTIM_Module *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->CFG, LPTIM_CFG_TRGEN));
}

/**
  * @}
  */

/** @defgroup LPTIM_EF_Clock_Configuration Clock Configuration
  * @{
  */

/**
  * @brief  Set the source of the clock used by the LPTIM instance.
  * @note This function must be called when the LPTIM instance is disabled.
  * @rmtoll CFG         CKSEL         LPTIM_SetClockSource
  * @param  LPTIMx Low-Power Timer instance
  * @param  ClockSource This parameter can be one of the following values:
  *         @arg @ref LPTIM_CLK_SOURCE_INTERNAL
  *         @arg @ref LPTIM_CLK_SOURCE_EXTERNAL
  * @retval None
  */
void LPTIM_SetClockSource(LPTIM_Module *LPTIMx, uint32_t ClockSource)
{
    MODIFY_REG(LPTIMx->CFG, LPTIM_CFG_CLKSEL, ClockSource);
}

/**
  * @brief  Get actual LPTIM instance clock source.
  * @rmtoll CFG         CKSEL         LPTIM_GetClockSource
  * @param  LPTIMx Low-Power Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LPTIM_CLK_SOURCE_INTERNAL
  *         @arg @ref LPTIM_CLK_SOURCE_EXTERNAL
  */
uint32_t LPTIM_GetClockSource(LPTIM_Module *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->CFG, LPTIM_CFG_CLKSEL));
}

/**
  * @brief  Configure the active edge or edges used by the counter when the LPTIM is clocked by an external clock source.
  * @note This function must be called when the LPTIM instance is disabled.
  * @note When both external clock signal edges are considered active ones,
  *       the LPTIM must also be clocked by an internal clock source with a
  *       frequency equal to at least four times the external clock frequency.
  * @note An internal clock source must be present when a digital filter is
  *       required for external clock.
  * @rmtoll CFG         CKFLT         LPTIM_ConfigClock\n
  *         CFG         CKPOL         LPTIM_ConfigClock
  * @param  LPTIMx Low-Power Timer instance
  * @param  ClockFilter This parameter can be one of the following values:
  *         @arg @ref LPTIM_CLK_FILTER_NONE
  *         @arg @ref LPTIM_CLK_FILTER_2
  *         @arg @ref LPTIM_CLK_FILTER_4
  *         @arg @ref LPTIM_CLK_FILTER_8
  * @param  ClockPolarity This parameter can be one of the following values:
  *         @arg @ref LPTIM_CLK_POLARITY_RISING
  *         @arg @ref LPTIM_CLK_POLARITY_FALLING
  *         @arg @ref LPTIM_CLK_POLARITY_RISING_FALLING
  * @retval None
  */
void LPTIM_ConfigClock(LPTIM_Module *LPTIMx, uint32_t ClockFilter, uint32_t ClockPolarity)
{
    MODIFY_REG(LPTIMx->CFG, LPTIM_CFG_CLKFLT | LPTIM_CFG_CLKPOL, ClockFilter | ClockPolarity);
}

/**
  * @brief  Get actual clock polarity
  * @rmtoll CFG         CKPOL         LPTIM_GetClockPolarity
  * @param  LPTIMx Low-Power Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LPTIM_CLK_POLARITY_RISING
  *         @arg @ref LPTIM_CLK_POLARITY_FALLING
  *         @arg @ref LPTIM_CLK_POLARITY_RISING_FALLING
  */
uint32_t LPTIM_GetClockPolarity(LPTIM_Module *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->CFG, LPTIM_CFG_CLKPOL));
}

/**
  * @brief  Get actual clock digital filter
  * @rmtoll CFG         CKFLT         LPTIM_GetClockFilter
  * @param  LPTIMx Low-Power Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LPTIM_CLK_FILTER_NONE
  *         @arg @ref LPTIM_CLK_FILTER_2
  *         @arg @ref LPTIM_CLK_FILTER_4
  *         @arg @ref LPTIM_CLK_FILTER_8
  */
uint32_t LPTIM_GetClockFilter(LPTIM_Module *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->CFG, LPTIM_CFG_CLKFLT));
}

/**
  * @}
  */

/** @defgroup LPTIM_EF_Encoder_Mode Encoder Mode
  * @{
  */

/**
  * @brief  Configure the encoder mode.
  * @note This function must be called when the LPTIM instance is disabled.
  * @rmtoll CFG         CKPOL         LPTIM_SetEncoderMode
  * @param  LPTIMx Low-Power Timer instance
  * @param  EncoderMode This parameter can be one of the following values:
  *         @arg @ref LPTIM_ENCODER_MODE_RISING
  *         @arg @ref LPTIM_ENCODER_MODE_FALLING
  *         @arg @ref LPTIM_ENCODER_MODE_RISING_FALLING
  * @retval None
  */
void LPTIM_SetEncoderMode(LPTIM_Module *LPTIMx, uint32_t EncoderMode)
{
    MODIFY_REG(LPTIMx->CFG, LPTIM_CFG_CLKPOL, EncoderMode);
}

/**
  * @brief  Get actual encoder mode.
  * @rmtoll CFG         CKPOL         LPTIM_GetEncoderMode
  * @param  LPTIMx Low-Power Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LPTIM_ENCODER_MODE_RISING
  *         @arg @ref LPTIM_ENCODER_MODE_FALLING
  *         @arg @ref LPTIM_ENCODER_MODE_RISING_FALLING
  */
uint32_t LPTIM_GetEncoderMode(LPTIM_Module *LPTIMx)
{
    return (uint32_t)(READ_BIT(LPTIMx->CFG, LPTIM_CFG_CLKPOL));
}

/**
  * @brief  Enable the encoder mode
  * @note This function must be called when the LPTIM instance is disabled.
  * @note In this mode the LPTIM instance must be clocked by an internal clock
  *       source. Also, the prescaler division ratio must be equal to 1.
  * @note LPTIM instance must be configured in continuous mode prior enabling
  *       the encoder mode.
  * @rmtoll CFG         ENC           LPTIM_EnableEncoderMode
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_EnableEncoderMode(LPTIM_Module *LPTIMx)
{
    SET_BIT(LPTIMx->CFG, LPTIM_CFG_ENC);
}
/**
  * @brief  Enable the encoder mode(NOENC)
  * @note This function must be called when the LPTIM instance is disabled.
  * @note In this mode the LPTIM instance must be clocked by an internal clock
  *       source. Also, the prescaler division ratio must be equal to 1.
  * @note LPTIM instance must be configured in continuous mode prior enabling
  *       the encoder mode.
  * @rmtoll CFG         NOENC           LPTIM_EnableEncoderMode
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_EnableNoEncoderMode(LPTIM_Module *LPTIMx)
{
    SET_BIT(LPTIMx->CFG, LPTIM_CFG_NENC);
}
/**
  * @brief  Disable the encoder mode
  * @note This function must be called when the LPTIM instance is disabled.
  * @rmtoll CFG         ENC           LPTIM_DisableEncoderMode
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_DisableEncoderMode(LPTIM_Module *LPTIMx)
{
    CLEAR_BIT(LPTIMx->CFG, LPTIM_CFG_ENC);
}
/**
  * @brief  Disable the encoder mode(NOENC) 
  * @note This function must be called when the LPTIM instance is disabled.
  * @rmtoll CFG         NOENC           LPTIM_DisableEncoderMode
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_DisableNoEncoderMode(LPTIM_Module *LPTIMx)
{
    CLEAR_BIT(LPTIMx->CFG, LPTIM_CFG_NENC);
}
/**
  * @brief  Indicates whether the LPTIM operates in encoder mode.
  * @rmtoll CFG         ENC           LPTIM_IsEnabledEncoderMode
  * @param  LPTIMx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
uint32_t LPTIM_IsEnabledEncoderMode(LPTIM_Module *LPTIMx)
{
    return (((READ_BIT(LPTIMx->CFG, LPTIM_CFG_ENC) == LPTIM_CFG_ENC)? 1UL : 0UL));
}

/**
  * @}
  */

/** @defgroup LPTIM_EF_FLAG_Management FLAG Management
  * @{
  */

/**
  * @brief  Clear the compare match flag (CMPMCF)
  * @rmtoll ICR          CMPMCF        LPTIM_ClearFLAG_CMPM
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_ClearFLAG_CMPM(LPTIM_Module *LPTIMx)
{
    SET_BIT(LPTIMx->INTCLR, LPTIM_INTCLR_CMPMCF);
}

/**
  * @brief  Inform application whether a compare match interrupt has occurred.
  * @rmtoll ISR          CMPM          LPTIM_IsActiveFlag_CMPM
  * @param  LPTIMx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
uint32_t LPTIM_IsActiveFlag_CMPM(LPTIM_Module *LPTIMx)
{
    return (((READ_BIT(LPTIMx->INTSTS,LPTIM_INTSTS_CMPM) ==LPTIM_INTSTS_CMPM)? 1UL : 0UL));
}

/**
  * @brief  Clear the autoreload match flag (ARRMCF)
  * @rmtoll ICR          ARRMCF        LPTIM_ClearFLAG_ARRM
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_ClearFLAG_ARRM(LPTIM_Module *LPTIMx)
{
    SET_BIT(LPTIMx->INTCLR, LPTIM_INTCLR_ARRMCF);
}

/**
  * @brief  Inform application whether a autoreload match interrupt has occured.
  * @rmtoll ISR          ARRM          LPTIM_IsActiveFlag_ARRM
  * @param  LPTIMx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
uint32_t LPTIM_IsActiveFlag_ARRM(LPTIM_Module *LPTIMx)
{
    return (((READ_BIT(LPTIMx->INTSTS,LPTIM_INTSTS_ARRM) ==LPTIM_INTSTS_ARRM)? 1UL : 0UL));
}

/**
  * @brief  Clear the external trigger valid edge flag(EXTTRIGCF).
  * @rmtoll ICR          EXTTRIGCF     LPTIM_ClearFlag_EXTTRIG
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_ClearFlag_EXTTRIG(LPTIM_Module *LPTIMx)
{
    SET_BIT(LPTIMx->INTCLR, LPTIM_INTCLR_EXTRIGCF);
}

/**
  * @brief  Inform application whether a valid edge on the selected external trigger input has occurred.
  * @rmtoll ISR          EXTTRIG       LPTIM_IsActiveFlag_EXTTRIG
  * @param  LPTIMx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
uint32_t LPTIM_IsActiveFlag_EXTTRIG(LPTIM_Module *LPTIMx)
{
    return (((READ_BIT(LPTIMx->INTSTS,LPTIM_INTSTS_EXTRIG) ==LPTIM_INTSTS_EXTRIG)? 1UL : 0UL));
}

/**
  * @brief  Clear the compare register update interrupt flag (CMPOKCF).
  * @rmtoll ICR          CMPOKCF       LPTIM_ClearFlag_CMPOK
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_ClearFlag_CMPOK(LPTIM_Module *LPTIMx)
{
    SET_BIT(LPTIMx->INTCLR, LPTIM_INTCLR_CMPUPDCF);
}

/**
  * @brief  Informs application whether the APB bus write operation to the LPTIMx_CMP register has been successfully completed. If so, a new one can be initiated.
  * @rmtoll ISR          CMPOK         LPTIM_IsActiveFlag_CMPOK
  * @param  LPTIMx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
uint32_t LPTIM_IsActiveFlag_CMPOK(LPTIM_Module *LPTIMx)
{
    return (((READ_BIT(LPTIMx->INTSTS,LPTIM_INTSTS_CMPUPD) ==LPTIM_INTSTS_CMPUPD)? 1UL : 0UL));
}

/**
  * @brief  Clear the autoreload register update interrupt flag (ARROKCF).
  * @rmtoll ICR          ARROKCF       LPTIM_ClearFlag_ARROK
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_ClearFlag_ARROK(LPTIM_Module *LPTIMx)
{
    SET_BIT(LPTIMx->INTCLR, LPTIM_INTCLR_ARRUPDCF);
}

/**
  * @brief  Informs application whether the APB bus write operation to the LPTIMx_ARR register has been successfully completed. If so, a new one can be initiated.
  * @rmtoll ISR          ARROK         LPTIM_IsActiveFlag_ARROK
  * @param  LPTIMx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
uint32_t LPTIM_IsActiveFlag_ARROK(LPTIM_Module *LPTIMx)
{
    return (((READ_BIT(LPTIMx->INTSTS,LPTIM_INTSTS_ARRUPD) ==LPTIM_INTSTS_ARRUPD)? 1UL : 0UL));
}

/**
  * @brief  Clear the counter direction change to up interrupt flag (UPCF).
  * @rmtoll ICR          UPCF          LPTIM_ClearFlag_UP
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_ClearFlag_UP(LPTIM_Module *LPTIMx)
{
    SET_BIT(LPTIMx->INTCLR, LPTIM_INTCLR_UPCF);
}

/**
  * @brief  Informs the application whether the counter direction has changed from down to up (when the LPTIM instance operates in encoder mode).
  * @rmtoll ISR          UP            LPTIM_IsActiveFlag_UP
  * @param  LPTIMx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
uint32_t LPTIM_IsActiveFlag_UP(LPTIM_Module *LPTIMx)
{
    return (((READ_BIT(LPTIMx->INTSTS, LPTIM_INTSTS_UP) == LPTIM_INTSTS_UP)? 1UL : 0UL));
}

/**
  * @brief  Clear the counter direction change to down interrupt flag (DOWNCF).
  * @rmtoll ICR          DOWNCF        LPTIM_ClearFlag_DOWN
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_ClearFlag_DOWN(LPTIM_Module *LPTIMx)
{
    SET_BIT(LPTIMx->INTCLR, LPTIM_INTCLR_DOWNCF);
}

/**
  * @brief  Informs the application whether the counter direction has changed from up to down (when the LPTIM instance operates in encoder mode).
  * @rmtoll ISR          DOWN          LPTIM_IsActiveFlag_DOWN
  * @param  LPTIMx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
uint32_t LPTIM_IsActiveFlag_DOWN(LPTIM_Module *LPTIMx)
{
    return (((READ_BIT(LPTIMx->INTSTS,LPTIM_INTSTS_DOWN) ==LPTIM_INTSTS_DOWN)? 1UL : 0UL));
}

/**
  * @}
  */

/** @defgroup LPTIM_EF_IT_Management Interrupt Management
  * @{
  */

/**
  * @brief  Enable compare match interrupt (CMPMIE).
  * @rmtoll IER          CMPMIE        LPTIM_EnableIT_CMPM
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_EnableIT_CMPM(LPTIM_Module *LPTIMx)
{
    SET_BIT(LPTIMx->INTEN, LPTIM_INTEN_CMPMIE);
}

/**
  * @brief  Disable compare match interrupt (CMPMIE).
  * @rmtoll IER          CMPMIE        LPTIM_DisableIT_CMPM
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_DisableIT_CMPM(LPTIM_Module *LPTIMx)
{
    CLEAR_BIT(LPTIMx->INTEN, LPTIM_INTEN_CMPMIE);
}

/**
  * @brief  Indicates whether the compare match interrupt (CMPMIE) is enabled.
  * @rmtoll IER          CMPMIE        LPTIM_IsEnabledIT_CMPM
  * @param  LPTIMx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
uint32_t LPTIM_IsEnabledIT_CMPM(LPTIM_Module *LPTIMx)
{
    return (((READ_BIT(LPTIMx->INTEN, LPTIM_INTEN_CMPMIE) == LPTIM_INTEN_CMPMIE)? 1UL : 0UL));
}

/**
  * @brief  Enable autoreload match interrupt (ARRMIE).
  * @rmtoll IER          ARRMIE        LPTIM_EnableIT_ARRM
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_EnableIT_ARRM(LPTIM_Module *LPTIMx)
{
    SET_BIT(LPTIMx->INTEN, LPTIM_INTEN_ARRMIE);
}

/**
  * @brief  Disable autoreload match interrupt (ARRMIE).
  * @rmtoll IER          ARRMIE        LPTIM_DisableIT_ARRM
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_DisableIT_ARRM(LPTIM_Module *LPTIMx)
{
    CLEAR_BIT(LPTIMx->INTEN, LPTIM_INTEN_ARRMIE);
}

/**
  * @brief  Indicates whether the autoreload match interrupt (ARRMIE) is enabled.
  * @rmtoll IER          ARRMIE        LPTIM_IsEnabledIT_ARRM
  * @param  LPTIMx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
uint32_t LPTIM_IsEnabledIT_ARRM(LPTIM_Module *LPTIMx)
{
    return (((READ_BIT(LPTIMx->INTEN, LPTIM_INTEN_ARRMIE) == LPTIM_INTEN_ARRMIE)? 1UL : 0UL));
}

/**
  * @brief  Enable external trigger valid edge interrupt (EXTTRIGIE).
  * @rmtoll IER          EXTTRIGIE     LPTIM_EnableIT_EXTTRIG
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_EnableIT_EXTTRIG(LPTIM_Module *LPTIMx)
{
    SET_BIT(LPTIMx->INTEN, LPTIM_INTEN_EXTRIGIE);
}

/**
  * @brief  Disable external trigger valid edge interrupt (EXTTRIGIE).
  * @rmtoll IER          EXTTRIGIE     LPTIM_DisableIT_EXTTRIG
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_DisableIT_EXTTRIG(LPTIM_Module *LPTIMx)
{
    CLEAR_BIT(LPTIMx->INTEN, LPTIM_INTEN_EXTRIGIE);
}

/**
  * @brief  Indicates external trigger valid edge interrupt (EXTTRIGIE) is enabled.
  * @rmtoll IER          EXTTRIGIE     LPTIM_IsEnabledIT_EXTTRIG
  * @param  LPTIMx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
uint32_t LPTIM_IsEnabledIT_EXTTRIG(LPTIM_Module *LPTIMx)
{
    return (((READ_BIT(LPTIMx->INTEN, LPTIM_INTEN_EXTRIGIE) == LPTIM_INTEN_EXTRIGIE)? 1UL : 0UL));
}

/**
  * @brief  Enable compare register write completed interrupt (CMPOKIE).
  * @rmtoll IER          CMPOKIE       LPTIM_EnableIT_CMPOK
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_EnableIT_CMPOK(LPTIM_Module *LPTIMx)
{
    SET_BIT(LPTIMx->INTEN, LPTIM_INTEN_CMPUPDIE);
}

/**
  * @brief  Disable compare register write completed interrupt (CMPOKIE).
  * @rmtoll IER          CMPOKIE       LPTIM_DisableIT_CMPOK
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_DisableIT_CMPOK(LPTIM_Module *LPTIMx)
{
    CLEAR_BIT(LPTIMx->INTEN, LPTIM_INTEN_CMPUPDIE);
}

/**
  * @brief  Indicates whether the compare register write completed interrupt (CMPOKIE) is enabled.
  * @rmtoll IER          CMPOKIE       LPTIM_IsEnabledIT_CMPOK
  * @param  LPTIMx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
uint32_t LPTIM_IsEnabledIT_CMPOK(LPTIM_Module *LPTIMx)
{
    return (((READ_BIT(LPTIMx->INTEN, LPTIM_INTEN_CMPUPDIE) == LPTIM_INTEN_CMPUPDIE)? 1UL : 0UL));
}

/**
  * @brief  Enable autoreload register write completed interrupt (ARROKIE).
  * @rmtoll IER          ARROKIE       LPTIM_EnableIT_ARROK
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_EnableIT_ARROK(LPTIM_Module *LPTIMx)
{
    SET_BIT(LPTIMx->INTEN, LPTIM_INTEN_ARRUPDIE);
}

/**
  * @brief  Disable autoreload register write completed interrupt (ARROKIE).
  * @rmtoll IER          ARROKIE       LPTIM_DisableIT_ARROK
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_DisableIT_ARROK(LPTIM_Module *LPTIMx)
{
    CLEAR_BIT(LPTIMx->INTEN, LPTIM_INTEN_ARRUPDIE);
}

/**
  * @brief  Indicates whether the autoreload register write completed interrupt (ARROKIE) is enabled.
  * @rmtoll IER          ARROKIE       LPTIM_IsEnabledIT_ARROK
  * @param  LPTIMx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
uint32_t LPTIM_IsEnabledIT_ARROK(LPTIM_Module *LPTIMx)
{
    return (((READ_BIT(LPTIMx->INTEN, LPTIM_INTEN_ARRUPDIE) == LPTIM_INTEN_ARRUPDIE)? 1UL : 0UL));
}

/**
  * @brief  Enable direction change to up interrupt (UPIE).
  * @rmtoll IER          UPIE          LPTIM_EnableIT_UP
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_EnableIT_UP(LPTIM_Module *LPTIMx)
{
    SET_BIT(LPTIMx->INTEN, LPTIM_INTEN_UPIE);
}

/**
  * @brief  Disable direction change to up interrupt (UPIE).
  * @rmtoll IER          UPIE          LPTIM_DisableIT_UP
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_DisableIT_UP(LPTIM_Module *LPTIMx)
{
    CLEAR_BIT(LPTIMx->INTEN, LPTIM_INTEN_UPIE);
}

/**
  * @brief  Indicates whether the direction change to up interrupt (UPIE) is enabled.
  * @rmtoll IER          UPIE          LPTIM_IsEnabledIT_UP
  * @param  LPTIMx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
uint32_t LPTIM_IsEnabledIT_UP(LPTIM_Module *LPTIMx)
{
    return (((READ_BIT(LPTIMx->INTEN, LPTIM_INTEN_UPIE) == LPTIM_INTEN_UPIE)? 1UL : 0UL));
}

/**
  * @brief  Enable direction change to down interrupt (DOWNIE).
  * @rmtoll IER          DOWNIE        LPTIM_EnableIT_DOWN
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_EnableIT_DOWN(LPTIM_Module *LPTIMx)
{
    SET_BIT(LPTIMx->INTEN, LPTIM_INTEN_DOWNIE);
}

/**
  * @brief  Disable direction change to down interrupt (DOWNIE).
  * @rmtoll IER          DOWNIE        LPTIM_DisableIT_DOWN
  * @param  LPTIMx Low-Power Timer instance
  * @retval None
  */
void LPTIM_DisableIT_DOWN(LPTIM_Module *LPTIMx)
{
    CLEAR_BIT(LPTIMx->INTEN, LPTIM_INTEN_DOWNIE);
}

/**
  * @brief  Indicates whether the direction change to down interrupt (DOWNIE) is enabled.
  * @rmtoll IER          DOWNIE        LPTIM_IsEnabledIT_DOWN
  * @param  LPTIMx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
uint32_t LPTIM_IsEnabledIT_DOWN(LPTIM_Module *LPTIMx)
{
    return ((READ_BIT(LPTIMx->INTEN, LPTIM_INTEN_DOWNIE) == LPTIM_INTEN_DOWNIE)? 1UL : 0UL);
}

/**
  * @}
  */


//#endif /* LPTIM */

/**
  * @}
  */
  
/**
  * @}
  */
  

/******************* (C) COPYRIGHT 2019 NATIONZ *****END OF FILE****/

